Revit.GeometryObjects.GeometryObjectSelector.ByReferenceStableRepresentation(System.String)
Return an AbstractGeometryObject given a string representation of the geometry's reference.
referenceString:
Returns:

Revit.GeometryObjects.GeometryObjectSelector.RequiresTransform(Autodesk.Revit.DB.FamilyInstance)
Determine if the Geometry extracted from a FamilyInstance requires transformation.
Bizarrely, some FamilyInstance's geom is transformed and some not when obtained
from GetGeometryObjectFromReference.  This is because some need to be transformed
to interact with adjacent geometry in the document.  This stop-gap, suggested by
SC in the Revit API team, checks if there are any non-empty GeometryInstances in
FamilyInstance's geometry.  Apparently this is a good heuristic for checking if
the geometry requires a transform or not.
familyInstance:
Returns: